# Ultralytics YOLO 🚀, AGPL-3.0 license
# YOLOv8 object detection model with P3-P5 outputs. For Usage examples see https://docs.ultralytics.com/tasks/detect

# Parameters
nc: 2 # number of classes
scales: # model compound scaling constants
  # [depth, width, max_channels]
  n: [0.33, 0.25, 1024]
  s: [0.33, 0.50, 1024]
  m: [0.67, 0.75, 768]
  l: [1.00, 1.00, 512]
  x: [1.00, 1.25, 512]

# YOLOv8.0n backbone
backbone:
  # [from, repeats, module, args]
  - [-1, 1, Conv, [64, 6, 2, 2]] # 0-P1/2

  - [-1, 1, Conv, [128, 3, 2]] # 1-P2/4
  - [-1, 6, C2f_Faster, [128, True]]
  - [-1, 1, FEM, [128]] # 3-P3/8

  - [-2, 1, Conv, [256, 3, 2]] # 5-P4/16
  - [-1, 6, C2f_Faster, [256, True]]
  - [-1, 1, FEM, [256]]

  - [-2, 1, Conv, [512, 3, 2]] # 7-P5/32
  - [-1, 9, C2f_Faster, [512, True]]
  - [-1, 1, SPPF, [512, 5]]

# YOLOv8.0n head
head:
  - [-1, 1, Conv, [256, 1, 1]]
  - [-1, 1, nn.Upsample, [None, 2, "nearest"]]
  - [[-1, 6], 1, FFM_Concat2, [1]]
  - [-1, 3, C2f_Faster, [256]]

  - [-1, 1, Conv, [128, 1, 1]]
  - [-1, 1, nn.Upsample, [None, 2, "nearest"]]
  - [[-1, 3], 1, FFM_Concat2, [1]]
  - [-1, 3, C2f_Faster, [128]] # (P3/8-small)

  - [-1, 1, Conv, [256, 3, 2]]
  - [[-1, 6, 14], 1, FFM_Concat3, [1]]
  - [-1, 3, C2f_Faster, [256]] # (P4/16-medium)

  - [-1, 1, Conv, [256, 3, 2]]
  - [[-1, 10], 1, FFM_Concat2, [1]]
  - [-1, 3, C2f_Faster, [512]] # (P5/32-large)

  - [17, 1, SCAM, []]
  - [20, 1, SCAM, []]
  - [23, 1, SCAM, []]

  - [[24, 25, 26], 1, Detect, [nc]] # Detect(P3, P4, P5)
