# Ultralytics 🚀 AGPL-3.0 License - https://ultralytics.com/license

# Ultralytics YOLO11 object detection model with P3/8 - P5/32 outputs
# Model docs: https://docs.ultralytics.com/models/yolo11
# Task docs: https://docs.ultralytics.com/tasks/detect

# Parameters
nc: 80 # number of classes
scales: # model compound scaling constants, i.e. 'model=yolo11n.yaml' will call yolo11.yaml with scale 'n'
  # [depth, width, max_channels]
  n: [0.50, 0.25, 1024] # summary: 181 layers, 2624080 parameters, 2624064 gradients, 6.6 GFLOPs
  s: [0.50, 0.50, 1024] # summary: 181 layers, 9458752 parameters, 9458736 gradients, 21.7 GFLOPs
  m: [0.50, 1.00, 512] # summary: 231 layers, 20114688 parameters, 20114672 gradients, 68.5 GFLOPs
  l: [1.00, 1.00, 512] # summary: 357 layers, 25372160 parameters, 25372144 gradients, 87.6 GFLOPs
  x: [1.00, 1.50, 512] # summary: 357 layers, 56966176 parameters, 56966160 gradients, 196.0 GFLOPs

# YOLO11n backbone
backbone:
  # [from, repeats, module, args]
  - [-1, 1, Conv, [64, 3, 2]] # 0-P1/2
  - [-1, 1, Conv, [128, 3, 2]] # 1-P2/4
  - [-1, 2, C3k2, [256, False, 0.25]]
  - [-1, 1, Conv, [256, 3, 2]] # 3-P3/8
  - [-1, 2, C3k2, [512, False, 0.25]]
  - [-1, 1, Conv, [512, 3, 2]] # 5-P4/16
  - [-1, 2, C3k2, [512, True]]
  - [-1, 1, Conv, [1024, 3, 2]] # 7-P5/32
  - [-1, 2, C3k2, [1024, True]]
  - [-1, 1, SPPF, [1024, 5]] # 9
  - [-1, 2, C2PSA, [1024]] # 10



# YOLO11n head
# YOLO11n head
head:
  - [-1, 1, nn.Upsample, [None, 2, "nearest"]]      # 11: P5 -> P4 (upsample)
  - [[-1, 6], 1, Concat, [1]]                       # 12: cat(P5_up, backbone P4)
  - [-1, 2, C3k2, [512, False]]                     # 13: P4 head feature (before LMAB)

  - [-1, 1, nn.Upsample, [None, 2, "nearest"]]      # 14: P4 -> P3 (upsample)
  - [[-1, 4], 1, Concat, [1]]                       # 15: cat(P4_up, backbone P3)
  - [-1, 2, C3k2, [256, False]]                     # 16: P3 head feature (small)

  - [-1, 1, Conv, [256, 3, 2]]                      # 17: P3 -> P4 (downsample)
  - [[-1, 13], 1, Concat, [1]]                      # 18: cat(P3_down, P4 head)
  - [-1, 2, C3k2, [512, False]]                     # 19: P4 head feature (medium)

  - [-1, 1, Conv, [512, 3, 2]]                      # 20: P4 -> P5 (downsample)
  - [[-1, 10], 1, Concat, [1]]                      # 21: cat(P4_down, backbone P5)
  - [-1, 2, C3k2, [1024, True]]                     # 22: P5 head feature (large)

  - [16, 1, LMAB, [256]]                            # 23: P3_LLMAB (small objects)
  - [19, 1, LMAB, [512]]                            # 24: P4_LMAB (medium objects)
  - [22, 1, LMAB, [1024]]                           # 25: P5_LMAB (large objects)

  - [[23, 24, 25], 1, Detect, [nc]]                 # 26: Detect(P3_LMAB, P4_LMAB, P5_LMAB)

